[{"jobTitle":"Software Engineer","about":"World Travel Holdings is the world's largest cruise agency and award-winning leisure-travel company with a portfolio of more than 40 diverse brands. In addition to owning some of the largest brands distributing cruises, villas, hotels, resort vacations, cars and luxury travel services, World Travel Holdings has a vast portfolio of licensed private label partnerships comprised of top leisure travel providers, including almost every U.S. airline, leading hotel brands and prominent corporations. The company also operates a top-rated travel agency franchise and the country's original host agency, and is consistently recognized as an industry leader in work-at-home employment. Its global presence includes operating multiple owned and private label cruise and vacation brands in the United Kingdom. World Travel Holdings has offices in Long Island, NY; Wilmington, Mass.; Ft. Lauderdale, Fla.; Virginia Beach, Va.; and Chorley, United Kingdom.","company":"World Travel Holdings","jobDesc":"Design and develop clear and comprehensive technical solutions across the full stack. Lead/participate in design discussions, prototype development and code reviews. Ability to work in an agile team environment, and collaborate cross-functionall to develop in sprints. Provide support and upgrade expertise to Legacy ASP code base. Debug and troubleshoot existing program code, and determine optimum solutions when requiree. Ability to manage priorities and schedules, including status reports to project management team. Comply with coding, project standards and processes","datePosted":"06/10/17","responsibilities":"Bachelor’s degree in computer science or related field. At least 2-3 years of web development experience utilizing Java/J2EE/JSP and ASP. Experience utilizing Spring and Hibernate DAO/JPA.  Angular JS 1 & 2 a significant plus. Hands on experience with ASP. Working knowledge of *nix systems (particularly Linux on CentOS). Working knowledge of HTML/CSS/Javascript /JQuery. Experience with relational databases and working knowledge of SQL (Oracle). Practical, in-depth knowledge of the fundamentals of object-oriented design and programming. Exceptional analytical skills and problem solving ability. Very strong, delivery focused work ethic that takes ownership and produces results. Ability to multitask and switch tracks as needed. Solid verbal and written communication skills. Ability to cultivate and maintain collaborative relationships within the team and the enterprise at large","address1":"4971 Ringwood Meadows","address2":"Sarasota, FL 34235"},{"jobTitle":"Federal - Full Stack Developer","about":"Accenture people build careers in four different areas of our business: Consulting, Technology, Outsourcing and internal Corporate Functions. Each area offers a unique career experience and a compelling mix of work and training opportunities, work environment and structure for career progression.Technology professionals implement and lead highly complex technology projects. Working with clients, they design, develop and deliver innovative technology solutions that drive high performance. These professionals may build, test, install and maintain software across a variety of projects and industries, working with leading enterprise applications such as SAP, Siebel, PeopleSoft and Oracle or with custom-built applications, and they are involved in a wide range of challenging global technology projects.","company":"PharmaDiversity","jobDesc":"Ownership of technical designs, code development, and component test execution to demonstrate adherence to the functional specification. Using configuration management and integration/build automation tools to manage and deploy Java code. Applying knowledge of common, relevant architecture frameworks in defining and evaluating application architectures. Performing code reviews and providing critical suggestions for fixes and improvements. Supporting issue analysis and fix activities during test phases, as well as production issue resolution. Troubleshooting and performance tuning Java-based applications. Developing and demonstrating a broad set of technology skills in Java technologies, Service Oriented Architecture concepts, Open Source libraries and frameworks, and technology architecture concepts.Collaborating within a project team comprised of talented employees with diverse and complementary skills.","datePosted":"06/09/17","responsibilities":"Experience with Java & JEE frameworks. Experience with Eclipse/IntelliJ/NetBeans/FireBug/Chrome development tools. Experience with databases, SQL, data modeling. Experience with performance tuning. Experience with mobile (IOS, Android). Experience with responsive web development (e.g. bootstrap, zurb foundation, etc.). Experience dynamic stylesheet languages (e.g. SASS, LESS). Experience with Agile (SCRUM, Kanban), Standard SDLC, CMMI compliant projects. Experience with issue tracking software (e.g. JIRA, BugZilla, Rational Suite). Experience with source control management (SVN, GIT, Mercurial, CVS). Experience with build/continuous integration (Maven, Ant, Grunt, Gulp). Previous consulting/contracting experience. Bachelor's Degree in Computer Science, Engineering or Technical Science","address1":"960 POST OAK CLOSE","address2":"Alpharetta, GA, 30004"},{"jobTitle":"NodeJS Developer","about":"The Node JS developer role will be responsible for implement and developing full stack platforms, APIs and complete user interface in the form of a mobile and desktop web app, with a focus on performance. Main duties will include creating modules and components both front end and back end and coupling them together into a functional app. Working with Architects and offshore development teams to build end to end platforms.","company":"OrageTheory","jobDesc":"Develop highly interactive web applications utilizing JavaScript, HTML5, CSS, JSON, Angular JS 1,5, 2.0, Angular material & later versions and integrating Restful API’s, external web services ensuring high performance on Mobile and Desktop. Provide SEO solutions for single page apps.","datePosted":"06/08/17","responsibilities":"Bachelor’s Degree in Information Technology or Computer Science.Minimum 4 years of related work experience in technology.A minimum of 2 years commercial experience in a node JS developer role.J2EE and Front End technologies with full stack development. Experience with Angular JS, react/Flux.Experience in Angular 1.5, 2.0 and later version.Experience testing AngularJS application via Jasmine and protractor.Ability to translate responsive design into application architectures.4 years of experience with strong proficiency with Javascript, Node.JS and related frameworks with a go.understanding of server side, accessibility and security compliance.Strong knowledge of integrating multiple sources following fundamental design principles for a scalable application. Experience in creating configuration build and test scripts for continuous integration. Proficient understanding code versioning tools such as GIT Repository. Expertise with HTML5 including CSS3, browser API’s and canvas. Experience in consuming Restful API’s. Expert knowledge and experience with JSON / XML / RESTful Web Services and services integration with AngularJS mobile responsive apps . Experience in documenting the code and writing unit test cases . Experienced with Agile Development methodologies . Strong knowledge and experience with HTML5, CSS3, and JavaScript. . Proficient on SPA JavaScript frameworks such as AngularJS (preferable 2.0). . Experience building web applications for mobile devices. . Deep knowledge of Angular JS practices and commonly used modules based on extensive work experience creating self-contained, reusable and testable modules and components.. A deep understanding of web technology stack including extensive experience in Angular JS stack. Knowledge of highly interactive web apps (HTML, Java script, Angular JS). Knowledge on how to integrate web applications with Restful API’s. Strong knowledge on WCAG 2.0 accessibility standards and guidelines.. Knowledge of UI best practices.. Strong knowledge of Java tools and IDEs such as Eclipse and Maven.. Good Knowledge of Relational and Non-relational databases. Experience designing consumer, enterprise software, or transactional web sites (e-commerce, Mobile, etc.).. Experience designing for mobile devices: iPhone, iPad, Blackberry, Android.. Experience in researching users and conducting usability testing.. Technical experience in HTML and CSS coding.. Previous experience in impressive and dynamic GUI Design. Business analysis. A strong portfolio that reflects your industry experience. Proven knowledge of usability and its principles. Strong experience in creating user-centred designs. Graphical competence in developing wireframe designs. Advanced skills in Adobe Photoshop and Dreamweaver or other graphic design software desirable. Excellent written and verbal communication skills. Some experience in the analysis, development and implementation of software based business. Some experience in formal project management activities. Some experience in process mapping and change control. Excellent conceptual and big-picture design skills including user experience architecture and information architecture.Natural ability to empathise with different end user groups.Strong visual design skills and a detailed knowledge of fundamental design principles and disciplines that affect typography, colour use, animation, composition, use of space, weight etc.Attention to detail and the ability to distil simple solutions from complex problems.A deep understanding of user-centred product development methodology.Self-motivated, solution-oriented and willing to work in a fast paced online development environment.Strong interaction and information design skills.Can represent abstract concepts visually with workflows, wireframes, site maps, concept diagrams for Users and stakeholders at all technical levels.Strong familiarity with Web design patterns and UI toolkits.Fluent in a range of design tools.","address1":"395 Congress Ave","address2":"Boynton Beach, FL 33426"},{"jobTitle":"Software Development Manager","about":"The Application Development Manager will work in concert with product management, senior business leadership, ensuring that technical direction and approach aligns vertically throughout company technology stack while leading a team of developers in a Java environment. He/she will be tasked with accelerating the delivery of features in a highly agile environment while safeguarding quality. The ideal candidate will bring extensive experience in a dev management capacity and the innate ability to manage multiple priorities, often with competing deadlines.","company":"Ascendo Resources","jobDesc":"Lead software engineering team of 6-8 Java Developers. Provide effective leadership and meaningful guidance to development team. Steward team towards accelerated the delivery of features while safeguarding quality. Collaborate with QA and Product teams to release software in a timely fashion. Cultivate a data-driven professional culture that rewards operational excellence and continuous improvement.. Create an environment that places emphasis on career and personal development.. Contribute to buy decisions and vendor selection activities.Continually monitor industry trends & standards","datePosted":"06/07/17","responsibilities":"College Degree, CS/CE or related. 4+ years managing development teams of 6-10 engineers. Min 8+ years OO software design and development experience. Demonstrable record of driving the highest levels of quality & productivity. Experience managing teams in true AGILE environments. Excellent communication, documentation and presentation skills. Ability to multi-task, prioritize and meet deadlines in a fast-paced environment","address1":"500 W Cypress Creek Rd #230","address2":"Fort Lauderdale, FL 33309"},{"jobTitle":"Full Stack Software Engineer","about":"OReilly's mission is 'changing the world by sharing the knowledge of innovators.' For over 30 years, we've been helping people learn new skills, track significant new technologies, and build careers in technology and business. This extends to our employees: we have a long and proud history of encouraging and enabling the people who work here to take advantage of OReilly's resources and network to keep learning, take on new challenges, and build careers.","company":"OReilly Media","jobDesc":"Our full stack engineers are focused on building a diverse family of scalable and robust services, aimed at a variety of educational audiences.   Software engineers work in two week sprints focused on new features designed collaboratively with product managers and other teammates.   They exchange code reviews with senior engineers, provide mentorship to support engineers, and assist QA and Ops with troubleshooting product issues.","datePosted":"06/06/17","responsibilities":"2 years of experience full stack web application development. Demonstrated competency with Python and Javascript. Familiarity with any combination of tox/py.test/Mocha for automated tests, and a passion for test-driven development. Familiarity with microservice architecture and building or maintaining APIS. Familiarity with continuous intergration tools and a rapid release cycle","address1":"2 Ave de Lafayette","address2":"Boston, MA 02111"},{"jobTitle":"Software Engineer","about":"World Travel Holdings is the world's largest cruise agency and award-winning leisure-travel company with a portfolio of more than 40 diverse brands. In addition to owning some of the largest brands distributing cruises, villas, hotels, resort vacations, cars and luxury travel services, World Travel Holdings has a vast portfolio of licensed private label partnerships comprised of top leisure travel providers, including almost every U.S. airline, leading hotel brands and prominent corporations. The company also operates a top-rated travel agency franchise and the country's original host agency, and is consistently recognized as an industry leader in work-at-home employment. Its global presence includes operating multiple owned and private label cruise and vacation brands in the United Kingdom. World Travel Holdings has offices in Long Island, NY; Wilmington, Mass.; Ft. Lauderdale, Fla.; Virginia Beach, Va.; and Chorley, United Kingdom.","company":"World Travel Holdings","jobDesc":"Design and develop clear and comprehensive technical solutions across the full stack. Lead/participate in design discussions, prototype development and code reviews. Ability to work in an agile team environment, and collaborate cross-functionally to develop in sprints. Provide support and upgrade expertise to Legacy ASP code base. Debug and troubleshoot existing program code, and determine optimum solutions when requiree. Ability to manage priorities and schedules, including status reports to project management team. Comply with coding, project standards and processes","datePosted":"06/10/17","responsibilities":"Bachelor’s degree in computer science or related field. At least 2-3 years of web development experience utilizing Java/J2EE/JSP and ASP. Experience utilizing Spring and Hibernate DAO/JPA.  Angular JS 1 & 2 a significant plus. Hands on experience with ASP. Working knowledge of *nix systems (particularly Linux on CentOS). Working knowledge of HTML/CSS/Javascript /JQuery. Experience with relational databases and working knowledge of SQL (Oracle). Practical, in-depth knowledge of the fundamentals of object-oriented design and programming. Exceptional analytical skills and problem solving ability. Very strong, delivery focused work ethic that takes ownership and produces results. Ability to multitask and switch tracks as needed. Solid verbal and written communication skills. Ability to cultivate and maintain collaborative relationships within the team and the enterprise at large","address1":"4971 Ringwood Meadows","address2":"Sarasota, FL 34235"}]
